brandonbraun653/Thor/Thor/thor_stm32hal_uart.cpp
/********************************************************************************
 * File Name:
 *   thor_uart.cpp
 *
 * Description:
 *   Implements the UART interface for Thor
 *
 * 2019 | Brandon Braun | brandonbraun653@gmail.com
 ********************************************************************************/

#if ( THOR_STM32HAL_DRIVERS == 1 ) && ( THOR_DRIVER_UART == 1 )

/* Boost Includes */
#include <boost/bind.hpp>
#include <boost/circular_buffer.hpp>

/* Chimera Includes */
#include <Chimera/watchdog.hpp>

/* Thor Includes */
#include <Thor/core.hpp>
#include <Thor/defaults/serial_defaults.hpp>
#include <Thor/definitions/serial_definitions.hpp>
#include <Thor/dma.hpp>
#include <Thor/headers.hpp>
#include <Thor/uart.hpp>

/* FreeRTOS Includes */
#ifdef __cplusplus
extern "C"
{
#endif

#include "FreeRTOS.h"
#include "semphr.h"

#ifdef __cplusplus
}
#endif

/* Mock Includes */
#if defined( GMOCK_TEST )
#include "mock_stm32_hal_uart.hpp"
#endif

using namespace Thor;
using namespace Thor::Serial;
using namespace Thor::UART;
using namespace Thor::GPIO;
using namespace Thor::Interrupt;
using namespace Chimera::Serial;

/*------------------------------------------------
Local Functions Declarations
------------------------------------------------*/
static constexpr bool isChannelSupported( const uint8_t channel );
static void UART4ISRPostProcessor( void *argument );
static void UART5ISRPostProcessor( void *argument );
static void UART7ISRPostProcessor( void *argument );
static void UART8ISRPostProcessor( void *argument );

static uint32_t uartClockMask( USART_TypeDef *const instance );
static UARTClass *const getUARTClassRef( USART_TypeDef *const instance );

/*------------------------------------------------
Local Data
------------------------------------------------*/
static std::array<UARTClass *, MAX_SERIAL_CHANNELS + 1> uartObjects;

/* Post Processor Thread Handles */
static std::array<TaskHandle_t, MAX_SERIAL_CHANNELS + 1> isrPPHandle;

/* Post Processor Thread Wakeup Signals */
static std::array<SemaphoreHandle_t, MAX_SERIAL_CHANNELS + 1> isrPPWakeup;

/* Post Processor Thread Function Pointers */ /* clang-format off */
static std::array<Chimera::Function::void_func_void_ptr, MAX_SERIAL_CHANNELS + 1> isrPPThread = { 
  nullptr, nullptr, nullptr, nullptr, 
  UART4ISRPostProcessor, 
  UART5ISRPostProcessor, nullptr,
  UART7ISRPostProcessor, 
  UART8ISRPostProcessor 
}; /* clang-format on */


namespace Thor::UART
{
  inline void UART_ClearIT_IDLE( UART_HandleTypeDef *const UartHandle )
  {
#if defined( STM32F7 )
    __HAL_UART_CLEAR_IT( UartHandle, UART_CLEAR_IDLEF );
#endif
  }

  inline void UART_EnableIT_IDLE( UART_HandleTypeDef *const UartHandle )
  {
    UART_ClearIT_IDLE( UartHandle );

#if defined( SIM )
#else
    __HAL_UART_ENABLE_IT( UartHandle, UART_IT_IDLE );
#endif /* SIM */
  }

  inline void UART_DisableIT_IDLE( UART_HandleTypeDef *const UartHandle )
  {
    UART_ClearIT_IDLE( UartHandle );

#if defined( SIM )
#else
    __HAL_UART_DISABLE_IT( UartHandle, UART_IT_IDLE );
#endif /* SIM */
  }

  UARTClass::UARTClass()
  {
    /*------------------------------------------------
    Register the mode change function pointers
    ------------------------------------------------*/
    modeChangeFuncPtrs[ static_cast<uint8_t>( Chimera::Hardware::SubPeripheralMode::BLOCKING ) ] = &UARTClass::setBlockingMode;
    modeChangeFuncPtrs[ static_cast<uint8_t>( Chimera::Hardware::SubPeripheralMode::INTERRUPT ) ] =
        &UARTClass::setInterruptMode;
    modeChangeFuncPtrs[ static_cast<uint8_t>( Chimera::Hardware::SubPeripheralMode::DMA ) ] = &UARTClass::setDMAMode;

    /*------------------------------------------------
    Register the read function pointers
    ------------------------------------------------*/
    readFuncPtrs[ static_cast<uint8_t>( Chimera::Hardware::SubPeripheralMode::BLOCKING ) ]  = &UARTClass::readBlocking;
    readFuncPtrs[ static_cast<uint8_t>( Chimera::Hardware::SubPeripheralMode::INTERRUPT ) ] = &UARTClass::readInterrupt;
    readFuncPtrs[ static_cast<uint8_t>( Chimera::Hardware::SubPeripheralMode::DMA ) ]       = &UARTClass::readDMA;

    /*------------------------------------------------
    Register the write function pointers
    ------------------------------------------------*/
    writeFuncPtrs[ static_cast<uint8_t>( Chimera::Hardware::SubPeripheralMode::BLOCKING ) ]  = &UARTClass::writeBlocking;
    writeFuncPtrs[ static_cast<uint8_t>( Chimera::Hardware::SubPeripheralMode::INTERRUPT ) ] = &UARTClass::writeInterrupt;
    writeFuncPtrs[ static_cast<uint8_t>( Chimera::Hardware::SubPeripheralMode::DMA ) ]       = &UARTClass::writeDMA;

    AUTO_ASYNC_RX = false;

    dmaRXReqSig = Thor::DMA::Source::NONE;
    dmaTXReqSig = Thor::DMA::Source::NONE;

    rxCompleteWakeup = nullptr;
    txCompleteWakeup = nullptr;

    awaitEventRXComplete = xSemaphoreCreateBinary();
    awaitEventTXComplete = xSemaphoreCreateBinary();


    txMode = Chimera::Hardware::SubPeripheralMode::UNKNOWN_MODE;
    rxMode = Chimera::Hardware::SubPeripheralMode::UNKNOWN_MODE;

#if defined( GMOCK_TEST )
    if ( !STM32HAL_Mock::uartMockObj )
    {
      STM32HAL_Mock::uartMockObj = std::make_shared<STM32HAL_Mock::UARTNiceMock>();
    }
#endif /* GMOCK_TEST */
  }

  UARTClass::~UARTClass()
  {
    uartObjects[ uart_channel ] = nullptr;
  }

  Chimera::Status_t UARTClass::assignHW( const uint8_t channel, const Chimera::Serial::IOPins &pins )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    if ( !isChannelSupported( channel ) )
    {
      error                             = Chimera::CommonStatusCodes::NOT_SUPPORTED;
      PeripheralState.hardware_assigned = false;
    }
    else
    {
      asyncRXDataSize = 0;

      /*------------------------------------------------
      Assign the default handle settings
      ------------------------------------------------*/
      uartObjects[ channel ] = this;
      uart_channel           = channel;
      uart_handle.Init       = dflt_UART_Init;
      uart_handle.Instance   = const_cast<USART_TypeDef *>( hwConfig[ uart_channel ]->instance );

#if defined( STM32F7 )
      uart_handle.AdvancedInit = Thor::Serial::dflt_UART_AdvInit;
#endif

