brandonbraun653/Thor/Thor/thor_stm32hal_uart.cpp
      /*------------------------------------------------
      Copy over the interrupt settings information
      ------------------------------------------------*/
      ITSettings_HW     = hwConfig[ uart_channel ]->IT_HW;
      ITSettings_DMA_TX = hwConfig[ uart_channel ]->dmaIT_TX;
      ITSettings_DMA_RX = hwConfig[ uart_channel ]->dmaIT_RX;

      dmaTXReqSig = Thor::Serial::DMATXRequestSignal[ uart_channel ];
      dmaRXReqSig = Thor::Serial::DMARXRequestSignal[ uart_channel ];

      /*------------------------------------------------
      Initialize the GPIO pins
      ------------------------------------------------*/
      const auto tx_port    = Thor::GPIO::convertPort( pins.tx.port );
      const auto tx_pin_num = Thor::GPIO::convertPinNum( pins.tx.pin );

      if ( !tx_port || ( tx_pin_num == PinNum::NOT_A_PIN ) )
      {
        error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
      }
      else
      {
        tx_pin = std::make_shared<Thor::GPIO::GPIOClass>();
        tx_pin->initAdvanced( tx_port, tx_pin_num, PinSpeed::ULTRA_SPD, pins.tx.alternate );
      }

      const auto rx_port    = Thor::GPIO::convertPort( pins.rx.port );
      const auto rx_pin_num = Thor::GPIO::convertPinNum( pins.rx.pin );

      if ( !rx_port || ( rx_pin_num == PinNum::NOT_A_PIN ) )
      {
        error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
      }
      else
      {
        rx_pin = std::make_shared<Thor::GPIO::GPIOClass>();
        rx_pin->initAdvanced( rx_port, rx_pin_num, PinSpeed::ULTRA_SPD, pins.rx.alternate );
      }

      UART_GPIO_Init();

      PeripheralState.hardware_assigned = true;
    }

    return error;
  }

  Chimera::Status_t UARTClass::begin( const Chimera::Hardware::SubPeripheralMode txMode,
                                      const Chimera::Hardware::SubPeripheralMode rxMode )
  {
    using namespace Chimera::Hardware;

    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    /*------------------------------------------------
    Transition to the desired user operating mode
    ------------------------------------------------*/
    error = setMode( Chimera::Hardware::SubPeripheral::TX, txMode );
    if ( error == Chimera::CommonStatusCodes::OK )
    {
      error = setMode( Chimera::Hardware::SubPeripheral::RX, rxMode );
    }

    /*------------------------------------------------
    Register the ISR post processor thread
    ------------------------------------------------*/
    if ( ( error == Chimera::CommonStatusCodes::OK ) && isrPPThread[ uart_channel ] )
    {
      isrPPWakeup[ uart_channel ] = xSemaphoreCreateBinary();
      isrPPHandle[ uart_channel ] = nullptr;

      Chimera::Threading::addThread( isrPPThread[ uart_channel ], "", 500, NULL, 5, &isrPPHandle[ uart_channel ] );
    }

    return error;
  }

  Chimera::Status_t UARTClass::end()
  {
    UART_DeInit();
    UART_GPIO_DeInit();
    UART_DisableInterrupts();
    UART_DMA_DeInit( Chimera::Hardware::SubPeripheral::TX );
    UART_DMA_DeInit( Chimera::Hardware::SubPeripheral::RX );

    txMode = Chimera::Hardware::SubPeripheralMode::UNKNOWN_MODE;
    rxMode = Chimera::Hardware::SubPeripheralMode::UNKNOWN_MODE;

    return Chimera::CommonStatusCodes::OK;
  }

  Chimera::Status_t UARTClass::configure( const uint32_t baud, const Chimera::Serial::CharWid width,
                                          const Chimera::Serial::Parity parity, const Chimera::Serial::StopBits stop,
                                          const Chimera::Serial::FlowControl flow )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    if ( !PeripheralState.hardware_assigned )
    {
      error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
    }
    else
    {
      bool result = true;

      UART_InitTypeDef init = uart_handle.Init;

      init.BaudRate = baud;
      result |= setWordLength( init, width );
      result |= setParity( init, parity );
      result |= setStopBits( init, stop );
      result |= setFlowControl( init, flow );

      if ( result )
      {
        error = UART_Init();
      }
      else
      {
        error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
      }
    }

    return error;
  }

  Chimera::Status_t UARTClass::setBaud( const uint32_t baud )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    if ( !PeripheralState.hardware_assigned )
    {
      error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
    }
    else
    {
      /*------------------------------------------------
      Copy, modify, write
      ------------------------------------------------*/
      UART_InitTypeDef init = uart_handle.Init;
      init.BaudRate         = baud;
      uart_handle.Init      = init;

      /*------------------------------------------------
      Clear the hardware config and re-initialize with new settings
      ------------------------------------------------*/
      UART_DeInit();
      UART_Init();
    }

    return error;
  }

  Chimera::Status_t UARTClass::setMode( const Chimera::Hardware::SubPeripheral periph,
                                        const Chimera::Hardware::SubPeripheralMode mode )
  {
    using namespace Chimera::Hardware;

    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;
    auto iter               = static_cast<uint8_t>( mode );

    /*------------------------------------------------
    Only bother changing modes if we currently aren't there
    ------------------------------------------------*/
    if ( !( ( ( periph == SubPeripheral::TX ) && ( txMode == mode ) ) ||
            ( ( periph == SubPeripheral::RX ) && ( rxMode == mode ) ) ) )
    {
      /*------------------------------------------------
      No matter what, the hardware must be assigned, configured, and transitioning to a valid mode.
      ------------------------------------------------*/
      if ( iter >= modeChangeFuncPtrs.size() )
      {
        error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
      }
      else if ( !PeripheralState.hardware_assigned || !PeripheralState.configured )
      {
        error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
      }

