brandonbraun653/Thor/Thor/thor_stm32hal_uart.cpp
      /*------------------------------------------------
      Validate the buffering initialization if transitioning to asynchronous mode
      ------------------------------------------------*/
      if ( ( periph == SubPeripheral::TX ) &&
           ( ( mode == SubPeripheralMode::INTERRUPT ) || ( mode == SubPeripheralMode::DMA ) ) &&
           !PeripheralState.tx_buffering_enabled )
      {
        error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
      }
      else if ( ( periph == SubPeripheral::RX ) &&
                ( ( mode == SubPeripheralMode::INTERRUPT ) || ( mode == SubPeripheralMode::DMA ) ) &&
                !PeripheralState.rx_buffering_enabled )
      {
        error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
      }

      /*------------------------------------------------
      Assuming all our checks "check out", we can switch modes
      ------------------------------------------------*/
      if ( error == Chimera::CommonStatusCodes::OK )
      {
        ( this->*( modeChangeFuncPtrs[ iter ] ) )( periph );
      }
    }

    return error;
  }

  Chimera::Status_t UARTClass::write( const uint8_t *const buffer, const size_t length, const uint32_t timeout_mS )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;
    auto iter               = static_cast<uint8_t>( txMode );

    if ( !PeripheralState.gpio_enabled || !PeripheralState.configured )
    {
      error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
    }
    else if ( iter >= writeFuncPtrs.size() )
    {
      error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
    }
    else
    {
      error = ( this->*( writeFuncPtrs[ iter ] ) )( buffer, length, timeout_mS );
    }

    return error;
  }

  Chimera::Status_t UARTClass::read( uint8_t *const buffer, const size_t length, const uint32_t timeout_mS )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;
    auto iter               = static_cast<uint8_t>( rxMode );

    if ( !PeripheralState.gpio_enabled || !PeripheralState.configured )
    {
      error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
    }
    else if ( iter >= readFuncPtrs.size() )
    {
      error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
    }
    else
    {
      error = ( this->*( readFuncPtrs[ iter ] ) )( buffer, length, timeout_mS );
    }

    return error;
  }

  Chimera::Status_t UARTClass::flush( const Chimera::Hardware::SubPeripheral periph )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      error = txBuffers.flush();
    }
    else if ( periph == Chimera::Hardware::SubPeripheral::RX )
    {
      error = rxBuffers.flush();
    }
    else
    {
      error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
    }

    return error;
  }

  void UARTClass::postISRProcessing()
  {
    if ( eventBits & Chimera::Event::Flags::BIT_WRITE_COMPLETE )
    {
      tx_complete = true;
      eventBits &= ~Chimera::Event::Flags::BIT_WRITE_COMPLETE;

      /*------------------------------------------------
      Transmit more data if we have any
      ------------------------------------------------*/
      if ( !txBuffers.external->empty() )
      {
        size_t bytesToWrite = std::min( txBuffers.external->size(), static_cast<size_t>( txBuffers.internalSize ) );
        memset( txBuffers.internal, 0, txBuffers.internalSize );

        for ( uint32_t x = 0; x < bytesToWrite; x++ )
        {
          txBuffers.internal[ x ] = txBuffers.external->front();
          txBuffers.external->pop_front();
        }

        write( txBuffers.internal, bytesToWrite );
      }
      else
      {
        /*------------------------------------------------
        Wake up any user threads
        ------------------------------------------------*/
        if ( txCompleteWakeup )
        {
          xSemaphoreGive( *txCompleteWakeup );
        }

        /*------------------------------------------------
        Wake up whatever thread called await()
        ------------------------------------------------*/
        xSemaphoreGive( awaitEventTXComplete );
      }
    }
    else if ( eventBits & Chimera::Event::Flags::BIT_READ_COMPLETE )
    {
      if ( rxMode == Chimera::Hardware::SubPeripheralMode::INTERRUPT )
      {
        if ( AUTO_ASYNC_RX )
        {
          /*------------------------------------------------
          We unexpectedly got some data, so dump it into the user's buffer for them
          to read later. Don't need to check if the buffer is valid as:

          1. ISR routine. We want AFAP.
          2. The buffer's existence is a requirement for this ISR to even execute.
          ------------------------------------------------*/
          for ( size_t x = 0; x < asyncRXDataSize; x++ )
          {
            rxBuffers.external->push_back( rxBuffers.internal[ x ] );
          }
          asyncRXDataSize = 0;
        }
        else
        {
          /*------------------------------------------------
          The user explicitly requested for data to be read
          ------------------------------------------------*/
          uint16_t actuallyRead = uart_handle.RxXferSize - uart_handle.RxXferCount;
          for ( uint16_t x = 0; x < actuallyRead; x++ )
          {
            rxBuffers.external->push_back( rxBuffers.internal[ x ] );
          }
        }

        /*------------------------------------------------
        Go back to async RX listening
        ------------------------------------------------*/
        __HAL_UART_ENABLE_IT( &uart_handle, UART_IT_RXNE );
      }
      else if ( rxMode == Chimera::Hardware::SubPeripheralMode::DMA )
      {
        /*------------------------------------------------
        Calculate how many bytes were received by looking at remaining RX buffer space.
                    num_received = bufferMaxSize - bufferSizeRemaining
        ------------------------------------------------*/
        auto num_received = static_cast<uint32_t>( uart_handle.RxXferSize - uart_handle.hdmarx->Instance->NDTR );

