brandonbraun653/Thor/Thor/thor_stm32hal_uart.cpp
      case static_cast<uint8_t>( Parity::PAR_ODD ):
        initStruct.Parity = UART_PARITY_ODD;
        break;

      case static_cast<uint8_t>( Parity::PAR_NONE ):
      default:
        initStruct.Parity = UART_PARITY_NONE;
        break;
    }

    /* All cases are handled, so it will always return true */
    return true;
  }

  bool UARTClass::setStopBits( UART_InitTypeDef &initStruct, const Chimera::Serial::StopBits stopBits )
  {
    bool result = true;

    switch ( static_cast<uint8_t>( stopBits ) )
    {
      case static_cast<uint8_t>( StopBits::SBITS_ONE ):
      default:
        initStruct.StopBits = UART_STOPBITS_1;
        break;

      case static_cast<uint8_t>( StopBits::SBITS_ONE_POINT_FIVE ):
        result = false;
        break;

      case static_cast<uint8_t>( StopBits::SBITS_TWO ):
        initStruct.StopBits = UART_STOPBITS_2;
        break;
    }

    return result;
  }

  bool UARTClass::setFlowControl( UART_InitTypeDef &initStruct, const Chimera::Serial::FlowControl flow )
  {
    switch ( static_cast<uint8_t>( flow ) )
    {
      case static_cast<uint8_t>( FlowControl::FCTRL_HW ):
        initStruct.HwFlowCtl = UART_HWCONTROL_RTS_CTS;
        break;

      case static_cast<uint8_t>( FlowControl::FCTRL_NONE ):
      case static_cast<uint8_t>( FlowControl::FCTRL_SW ):
      default:
        initStruct.HwFlowCtl = UART_HWCONTROL_NONE;
        break;
    }

    /* All cases are handled, so it will always return true */
    return true;
  }

  void UARTClass::setBlockingMode( const Chimera::Hardware::SubPeripheral periph )
  {
    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      txMode = Chimera::Hardware::SubPeripheralMode::BLOCKING;    // Must be set before the other functions

      /* Make sure RX side isn't using interrupts before disabling */
      if ( rxMode == Chimera::Hardware::SubPeripheralMode::BLOCKING )
      {
        UART_DisableInterrupts();
      }

      UART_DMA_DeInit( periph );
    }
    else
    {
      rxMode = Chimera::Hardware::SubPeripheralMode::BLOCKING;    // Must be set before the other functions

      /* Make sure TX side isn't using interrupts before disabling */
      if ( txMode == Chimera::Hardware::SubPeripheralMode::BLOCKING )
      {
        UART_DisableInterrupts();
      }

      UART_DMA_DeInit( periph );
    }
  }

  void UARTClass::setInterruptMode( const Chimera::Hardware::SubPeripheral periph )
  {
    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      txMode = Chimera::Hardware::SubPeripheralMode::INTERRUPT;

      UART_EnableInterrupts();
      UART_DMA_DeInit( periph );
    }
    else
    {
      rxMode = Chimera::Hardware::SubPeripheralMode::INTERRUPT;

      UART_EnableInterrupts();
      UART_DMA_DeInit( periph );
    }
  }

  void UARTClass::setDMAMode( const Chimera::Hardware::SubPeripheral periph )
  {
    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      txMode = Chimera::Hardware::SubPeripheralMode::DMA;

      UART_EnableInterrupts();
      UART_DMA_Init( periph );
    }
    else
    {
      rxMode        = Chimera::Hardware::SubPeripheralMode::DMA;
      AUTO_ASYNC_RX = true;

      UART_EnableInterrupts();
      UART_DMA_Init( periph );

      /* Set the idle line interrupt for asynchronously getting the end of transmission */
      UART_EnableIT_IDLE( &uart_handle );

      /* Instruct the DMA hardware to start listening for transmissions */
      memset( rxBuffers.internal, 0, rxBuffers.internalSize );
      HAL_UART_Receive_DMA( &uart_handle, rxBuffers.internal, rxBuffers.internalSize );
    }
  }

  Chimera::Status_t UARTClass::readBlocking( uint8_t *const buffer, const size_t length, const uint32_t timeout_mS )
  {
    HAL_StatusTypeDef stm32Error = HAL_BUSY;

    if ( lock( Chimera::Threading::TIMEOUT_DONT_WAIT ) == Chimera::CommonStatusCodes::OK )
    {
      /*------------------------------------------------
      It's possible to get into the condition where ORE is set before trying to receive some
      new data. In the current STM HAL library, all error interrupts for the blocking mode are
      disabled by default so the overrun has to be handled manually. This restores normal
      operation. A nearly exact condition of this bug is encountered here: https://goo.gl/bKi8Ps
      ------------------------------------------------*/
      UART_OverrunHandler();

#if defined( USING_FREERTOS )
      stm32Error = HAL_UART_Receive( &uart_handle, const_cast<uint8_t *>( buffer ), static_cast<uint16_t>( length ),
                                     pdMS_TO_TICKS( BLOCKING_TIMEOUT_MS ) );
#else
      stm32Error = HAL_UART_Receive( &uart_handle, const_cast<uint8_t *>( buffer ), static_cast<uint16_t>( length ),
                                     BLOCKING_TIMEOUT_MS );
#endif
      unlock();
    }

    return convertHALStatus( stm32Error );
  }

  Chimera::Status_t UARTClass::readInterrupt( uint8_t *const buffer, const size_t length, const uint32_t timeout_mS )
  {
    HAL_StatusTypeDef stm32Error = HAL_OK;
    Chimera::Status_t error      = Chimera::CommonStatusCodes::OK;

    /* clang-format off */
    if ( ( length <= rxBuffers.internalSize )
      && lock( Chimera::Threading::TIMEOUT_DONT_WAIT ) == Chimera::CommonStatusCodes::OK )
    { /* clang-format on */
      /*------------------------------------------------
      Let the ISR handler know that we explicitely asked to receive some data.
      This will cause a redirect into the correct ISR handling control flow.
      ------------------------------------------------*/
      AUTO_ASYNC_RX = false;
      memset( rxBuffers.internal, 0, rxBuffers.internalSize );
      stm32Error = HAL_UART_Receive_IT( &uart_handle, rxBuffers.internal, static_cast<uint16_t>( length ) );

      if ( stm32Error == HAL_OK )
      {
        error = Chimera::Serial::Status::RX_IN_PROGRESS;
      }
      else
      {
        error = convertHALStatus( stm32Error );
      }

      unlock();
    }
    else
    {
      error = Chimera::CommonStatusCodes::MEMORY;
    }

    return error;
  }

  Chimera::Status_t UARTClass::readDMA( uint8_t *const buffer, const size_t length, const uint32_t timeout_mS )
  {
    HAL_StatusTypeDef stm32Error = HAL_OK;
    Chimera::Status_t error      = Chimera::CommonStatusCodes::OK;

    /* clang-format off */
    if ( ( length <= rxBuffers.internalSize )
      && lock( Chimera::Threading::TIMEOUT_DONT_WAIT ) == Chimera::CommonStatusCodes::OK )
    { /* clang-format on */
      /*------------------------------------------------
      Let the ISR handler know that we explicitely asked to receive some data.
      This will cause a redirect into the correct handling channels.
      ------------------------------------------------*/
      AUTO_ASYNC_RX = false;

