brandonbraun653/Thor/Thor/thor_stm32hal_uart.cpp
      /*------------------------------------------------
      Stop any background listening for data and restart with the new transfer
      ------------------------------------------------*/
      HAL_UART_DMAStop( &uart_handle );
      memset( rxBuffers.internal, 0, rxBuffers.internalSize );
      stm32Error = HAL_UART_Receive_DMA( &uart_handle, rxBuffers.internal, static_cast<uint16_t>( length ) );

      if ( stm32Error == HAL_OK )
      {
        error = Chimera::Serial::Status::RX_IN_PROGRESS;
      }
      else
      {
        error = convertHALStatus( stm32Error );
      }

      unlock();
    }
    else
    {
      error = Chimera::CommonStatusCodes::MEMORY;
    }

    return error;
  }

  Chimera::Status_t UARTClass::writeBlocking( const uint8_t *const buffer, const size_t length, const uint32_t timeout_mS )
  {
    HAL_StatusTypeDef stm32Error = HAL_BUSY;

    if ( lock( Chimera::Threading::TIMEOUT_DONT_WAIT ) == Chimera::CommonStatusCodes::OK )
    {
#if defined( USING_FREERTOS )
      stm32Error = HAL_UART_Transmit( &uart_handle, const_cast<uint8_t *>( buffer ), static_cast<uint16_t>( length ),
                                      pdMS_TO_TICKS( BLOCKING_TIMEOUT_MS ) );
#else
      stm32Error = HAL_UART_Transmit( &uart_handle, const_cast<uint8_t *>( buffer ), static_cast<uint16_t>( length ),
                                      BLOCKING_TIMEOUT_MS );
#endif
      unlock();
    }

    return convertHALStatus( stm32Error );
  }

  Chimera::Status_t UARTClass::writeInterrupt( const uint8_t *const buffer, const size_t length, const uint32_t timeout_mS )
  {
    HAL_StatusTypeDef stm32Error = HAL_OK;
    Chimera::Status_t error      = Chimera::CommonStatusCodes::OK;

    /* clang-format off */
    if ( txBuffers.initialized()
      && PeripheralState.tx_buffering_enabled 
      && lock( Chimera::Threading::TIMEOUT_DONT_WAIT ) == Chimera::CommonStatusCodes::OK )
    { /* clang-format on */
      if ( tx_complete )
      {
        /*------------------------------------------------
        Hardware is free. Send the data directly.
        ------------------------------------------------*/
        tx_complete = false;
        stm32Error  = HAL_UART_Transmit_IT( &uart_handle, const_cast<uint8_t *>( buffer ), static_cast<uint16_t>( length ) );
        error       = convertHALStatus( stm32Error );
      }
      else
      {
        /*------------------------------------------------
        Queue up everything to send later
        ------------------------------------------------*/
        error = Chimera::CommonStatusCodes::BUSY;
        txBuffers.push( buffer, length );
      }

      unlock();
    }
    else
    {
      error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
    }

    return error;
  }

  Chimera::Status_t UARTClass::writeDMA( const uint8_t *const buffer, const size_t length, const uint32_t timeout_mS )
  {
    HAL_StatusTypeDef stm32Error = HAL_OK;
    Chimera::Status_t error      = Chimera::CommonStatusCodes::OK;

    /* clang-format off */
      if ( txBuffers.initialized()
        && PeripheralState.tx_buffering_enabled 
        && lock( Chimera::Threading::TIMEOUT_DONT_WAIT ) == Chimera::CommonStatusCodes::OK )
      { /* clang-format on */
      if ( tx_complete )
      {
        /*------------------------------------------------
        Hardware is free. Send the data directly.
        ------------------------------------------------*/
        tx_complete = false;
        stm32Error  = HAL_UART_Transmit_DMA( &uart_handle, const_cast<uint8_t *>( buffer ), static_cast<uint16_t>( length ) );
        error       = convertHALStatus( stm32Error );
      }
      else
      {
        /*------------------------------------------------
        Queue up everything to send later
        ------------------------------------------------*/
        error = Chimera::CommonStatusCodes::BUSY;
        txBuffers.push( buffer, length );
      }

      unlock();
    }
    else
    {
      error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
    }

    return error;
  }

  void UARTClass::IRQHandler_TXDMA()
  {
    HAL_DMA_IRQHandler( uart_handle.hdmatx );
  }

  void UARTClass::IRQHandler_RXDMA()
  {
    HAL_DMA_IRQHandler( uart_handle.hdmarx );
  }

  Chimera::Status_t UARTClass::UART_Init()
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    UART_EnableClock();

    if ( HAL_UART_Init( &uart_handle ) != HAL_OK )
    {
      error = Chimera::CommonStatusCodes::FAIL;
    }

    setMode( Chimera::Hardware::SubPeripheral::TX, Chimera::Hardware::SubPeripheralMode::BLOCKING );
    setMode( Chimera::Hardware::SubPeripheral::RX, Chimera::Hardware::SubPeripheralMode::BLOCKING );

    PeripheralState.configured = true;
    return error;
  }

  void UARTClass::UART_DeInit()
  {
    HAL_UART_DeInit( &uart_handle );
    PeripheralState.configured = false;
  }

  void UARTClass::UART_EnableClock()
  {
    using namespace Thor::Serial;

#if defined( SIM )
#else
#if defined( TARGET_STM32F7 ) || defined( TARGET_STM32F4 )
    RCC->APB1ENR |= ( uartClockMask( uart_handle.Instance ) );
#endif
#endif /* SIM */
  }

  void UARTClass::UART_DisableClock()
  {
    using namespace Thor::Serial;

#if defined( SIM )
#else
#if defined( TARGET_STM32F7 ) || defined( TARGET_STM32F4 )
    RCC->APB1ENR &= ~( uartClockMask( uart_handle.Instance ) );
#endif
#endif /* SIM */
  }

  void UARTClass::UART_DMA_EnableClock()
  {
    /* Global DMA Clock options. Only turn on capability is
    provided due to other peripherals possibly using DMA. */
#if defined( SIM )
#else
    if ( __HAL_RCC_DMA1_IS_CLK_DISABLED() )
    {
      __HAL_RCC_DMA1_CLK_ENABLE();
    }

    if ( __HAL_RCC_DMA2_IS_CLK_DISABLED() )
    {
      __HAL_RCC_DMA2_CLK_ENABLE();
    }
#endif /* SIM */
  }

  void UARTClass::UART_EnableInterrupts()
  {
    HAL_NVIC_DisableIRQ( ITSettings_HW.IRQn );
    HAL_NVIC_ClearPendingIRQ( ITSettings_HW.IRQn );
    HAL_NVIC_SetPriority( ITSettings_HW.IRQn, ITSettings_HW.preemptPriority, ITSettings_HW.subPriority );
    HAL_NVIC_EnableIRQ( ITSettings_HW.IRQn );

