brandonbraun653/Thor/Thor/thor_stm32hal_uart.cpp
    /*------------------------------------------------
    Make sure we are able to asynchronously receive some data if it gets sent
    ------------------------------------------------*/
    AUTO_ASYNC_RX = true;
    if ( rxMode == Chimera::Hardware::SubPeripheralMode::INTERRUPT )
    {
      /*------------------------------------------------
      In interrupt mode, we have to handle the RX FIFO on a byte by byte
      basis otherwise an overrun error is generated.
      ------------------------------------------------*/
#if defined( SIM )
#else
      __HAL_UART_ENABLE_IT( &uart_handle, UART_IT_RXNE );
#endif /* SIM */
    }

    PeripheralState.interrupts_enabled = true;
  }

  void UARTClass::UART_DisableInterrupts()
  {
#if defined( SIM )
#else
    __HAL_UART_DISABLE_IT( &uart_handle, UART_IT_IDLE );
    __HAL_UART_DISABLE_IT( &uart_handle, UART_IT_RXNE );
#endif /* SIM */

    HAL_NVIC_DisableIRQ( ITSettings_HW.IRQn );
    HAL_NVIC_ClearPendingIRQ( ITSettings_HW.IRQn );

    PeripheralState.interrupts_enabled = false;
  }

  void UARTClass::UART_GPIO_Init()
  {
    PeripheralState.gpio_enabled = true;

    if ( !tx_pin || ( tx_pin->setMode( Chimera::GPIO::Drive::ALTERNATE_PUSH_PULL, true ) != Chimera::CommonStatusCodes::OK ) )
    {
      PeripheralState.gpio_enabled = false;
    }

    if ( !rx_pin || ( rx_pin->setMode( Chimera::GPIO::Drive::ALTERNATE_PUSH_PULL, true ) != Chimera::CommonStatusCodes::OK ) )
    {
      PeripheralState.gpio_enabled = false;
    }
  }

  void UARTClass::UART_GPIO_DeInit()
  {
    // TODO: Implement GPIO DeInit
  }

  void UARTClass::UART_DMA_Init( const Chimera::Hardware::SubPeripheral periph )
  {
    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      UART_DMA_EnableClock();
      hdma_uart_tx.Instance = const_cast<DMA_Stream_TypeDef *>( hwConfig[ uart_channel ]->dmaTX.Instance );

      /* Grab the default init settings and modify for the specific hardware */
      hdma_uart_tx.Init           = dflt_DMA_Init_TX;
      hdma_uart_tx.Init.Channel   = hwConfig[ uart_channel ]->dmaTX.channel;
      hdma_uart_tx.Init.Direction = hwConfig[ uart_channel ]->dmaTX.direction;

      /* Hard error if initialization fails. */
      assert( HAL_DMA_Init( &hdma_uart_tx ) == HAL_OK );
      __HAL_LINKDMA( &uart_handle, hdmatx, hdma_uart_tx );

      /*------------------------------------------------
      Attach the class specific implementation TX DMA handler
      ------------------------------------------------*/
      Thor::DMA::requestHandlers[ dmaTXReqSig ] = boost::bind( &UARTClass::IRQHandler_TXDMA, this );

      UART_DMA_EnableIT( periph );

      PeripheralState.dma_enabled_tx = true;
    }
    else
    {
      UART_DMA_EnableClock();
      hdma_uart_rx.Instance = const_cast<DMA_Stream_TypeDef *>( hwConfig[ uart_channel ]->dmaRX.Instance );

      /* Grab the default init settings and modify for the specific hardware */
      hdma_uart_rx.Init           = dflt_DMA_Init_RX;
      hdma_uart_rx.Init.Channel   = hwConfig[ uart_channel ]->dmaRX.channel;
      hdma_uart_rx.Init.Direction = hwConfig[ uart_channel ]->dmaRX.direction;

      /* Hard error if initialization fails. */
      assert( HAL_DMA_Init( &hdma_uart_rx ) == HAL_OK );
      __HAL_LINKDMA( &uart_handle, hdmarx, hdma_uart_rx );

      /*------------------------------------------------
      Attach the class specific implementation TX DMA handler
      ------------------------------------------------*/
      Thor::DMA::requestHandlers[ dmaRXReqSig ] = boost::bind( &UARTClass::IRQHandler_RXDMA, this );

      UART_DMA_EnableIT( periph );

      PeripheralState.dma_enabled_rx = true;
    }
  }

  void UARTClass::UART_DMA_DeInit( const Chimera::Hardware::SubPeripheral periph )
  {
    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      if ( !PeripheralState.dma_enabled_tx )
        return;

      HAL_DMA_Abort( uart_handle.hdmatx );
      HAL_DMA_DeInit( uart_handle.hdmatx );
      UART_DMA_DisableIT( periph );
      Thor::DMA::requestHandlers[ dmaTXReqSig ].clear();

      PeripheralState.dma_enabled_tx = false;
    }
    else
    {
      if ( !PeripheralState.dma_enabled_rx )
        return;

      HAL_DMA_Abort( uart_handle.hdmarx );
      HAL_DMA_DeInit( uart_handle.hdmarx );
      UART_DMA_DisableIT( periph );
      Thor::DMA::requestHandlers[ dmaRXReqSig ].clear();

      PeripheralState.dma_enabled_rx = false;
    }
  }

  void UARTClass::UART_DMA_EnableIT( const Chimera::Hardware::SubPeripheral periph )
  {
    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      HAL_NVIC_DisableIRQ( ITSettings_DMA_TX.IRQn );
      HAL_NVIC_ClearPendingIRQ( ITSettings_DMA_TX.IRQn );
      HAL_NVIC_SetPriority( ITSettings_DMA_TX.IRQn, ITSettings_DMA_TX.preemptPriority, ITSettings_DMA_TX.subPriority );
      HAL_NVIC_EnableIRQ( ITSettings_DMA_TX.IRQn );

      PeripheralState.dma_interrupts_enabled_tx = true;
    }
    else
    {
      HAL_NVIC_DisableIRQ( ITSettings_DMA_RX.IRQn );
      HAL_NVIC_ClearPendingIRQ( ITSettings_DMA_RX.IRQn );
      HAL_NVIC_SetPriority( ITSettings_DMA_RX.IRQn, ITSettings_DMA_RX.preemptPriority, ITSettings_DMA_RX.subPriority );
      HAL_NVIC_EnableIRQ( ITSettings_DMA_RX.IRQn );

      PeripheralState.dma_interrupts_enabled_rx = true;
    }
  }

  void UARTClass::UART_DMA_DisableIT( const Chimera::Hardware::SubPeripheral periph )
  {
    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      HAL_NVIC_ClearPendingIRQ( ITSettings_DMA_TX.IRQn );
      HAL_NVIC_DisableIRQ( ITSettings_DMA_TX.IRQn );

      PeripheralState.dma_interrupts_enabled_tx = false;
    }
    else
    {
      HAL_NVIC_ClearPendingIRQ( ITSettings_DMA_RX.IRQn );
      HAL_NVIC_DisableIRQ( ITSettings_DMA_RX.IRQn );

      PeripheralState.dma_interrupts_enabled_rx = false;
    }
  }

  void UARTClass::UART_OverrunHandler()
  {
#if defined( STM32F7 )
    __HAL_UART_CLEAR_IT( &uart_handle, UART_CLEAR_OREF );
    uart_handle.Instance->RDR;
#endif
  }

#if defined( STM32F4 )
  void UARTClass::IRQHandler()
  {
    /*------------------------------------------------
    Handle Asynchronous RX in Interrupt and DMA Mode:
    The user did not ask for data, but we got some anyways (cause we were listening)
    ------------------------------------------------*/
    if ( AUTO_ASYNC_RX )
    {
      /*------------------------------------------------
      Reading these registers in the order of SR then DR ends up clearing all
      flags, so it's best to store the returned contents for further processing.
      ------------------------------------------------*/
      volatile uint32_t isrflags = READ_REG( uart_handle.Instance->SR );
      volatile uint32_t data_reg = READ_REG( uart_handle.Instance->DR );
      volatile uint32_t cr1      = READ_REG( uart_handle.Instance->CR1 );

