brandonbraun653/Thor/Thor/thor_stm32hal_uart.cpp
#if !defined( GMOCK_TEST )
void HAL_UART_TxCpltCallback( UART_HandleTypeDef *UartHandle )
{
  const auto uart = getUARTClassRef( UartHandle->Instance );

  if ( uart )
  {
    uart->eventBits |= Chimera::Event::Flags::BIT_WRITE_COMPLETE;

    /*------------------------------------------------
    Wake up and immediately switch to the user-land ISR
    handler thread. Should be a very high priority thread.
    ------------------------------------------------*/
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR( isrPPWakeup[ uart->uart_channel ], &xHigherPriorityTaskWoken );
    portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
  }
}

void HAL_UART_RxCpltCallback( UART_HandleTypeDef *UartHandle )
{
  const auto uart = getUARTClassRef( UartHandle->Instance );

  if ( uart )
  {
    uart->eventBits |= Chimera::Event::Flags::BIT_READ_COMPLETE;

    /*------------------------------------------------
    Wake up and immediately switch to the user-land ISR
    handler thread. Should be a very high priority thread.
    ------------------------------------------------*/
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR( isrPPWakeup[ uart->uart_channel ], &xHigherPriorityTaskWoken );
    portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
  }
}

void HAL_UART_TxHalfCpltCallback( UART_HandleTypeDef *UartHandle )
{
}

void HAL_UART_RxHalfCpltCallback( UART_HandleTypeDef *UartHandle )
{
}

void HAL_UART_ErrorCallback( UART_HandleTypeDef *UartHandle )
{
}

#endif /* !GMOCK_TEST */

void UART4_IRQHandler( void )
{
  if ( uartObjects[ 4 ] )
  {
    uartObjects[ 4 ]->IRQHandler();
  }
}

void UART5_IRQHandler( void )
{
  if ( uartObjects[ 5 ] )
  {
    uartObjects[ 5 ]->IRQHandler();
  }
}

void UART7_IRQHandler( void )
{
  if ( uartObjects[ 7 ] )
  {
    uartObjects[ 7 ]->IRQHandler();
  }
}

void UART8_IRQHandler( void )
{
  if ( uartObjects[ 8 ] )
  {
    uartObjects[ 8 ]->IRQHandler();
  }
}

static uint32_t uartClockMask( USART_TypeDef *const instance )
{
  /* Simply converts the pointer into the raw numerical address value, which be compared against
  the peripheral base address. UARTx is simply (USART_TypeDef*)UARTx_Base. */
  auto i = reinterpret_cast<std::uintptr_t>( instance );
  switch ( i )
  {
#if defined( STM32F446xx ) || defined( STM32F767xx )
#if defined( UART4 )
    case UART4_BASE:
      return RCC_APB1ENR_UART4EN;
      break;
#endif
#if defined( UART5 )
    case UART5_BASE:
      return RCC_APB1ENR_UART5EN;
      break;
#endif
#if defined( UART7 )
    case UART7_BASE:
      return RCC_APB1ENR_UART7EN;
      break;
#endif
#if defined( UART8 )
    case UART8_BASE:
      return RCC_APB1ENR_UART8EN;
      break;
#endif
#endif /* !STM32F446xx  !STM32F767xx */

    default:
      return 0u;
      break;
  };
};

static UARTClass *const getUARTClassRef( USART_TypeDef *const instance )
{
  /*------------------------------------------------
  Simply converts the pointer into the raw numerical address value, which be compared against
  the peripheral base address. UARTx is simply (USART_TypeDef*)UARTx_Base.
  ------------------------------------------------*/
  auto i = reinterpret_cast<std::uintptr_t>( instance );
  switch ( i )
  {
#if defined( UART1 )
    case UART1_BASE:
      return uartObjects[ 1 ];
      break;
#endif
#if defined( UART2 )
    case UART2_BASE:
      return uartObjects[ 2 ];
      break;
#endif
#if defined( UART3 )
    case UART3_BASE:
      return uartObjects[ 3 ];
      break;
#endif
#if defined( UART4 )
    case UART4_BASE:
      return uartObjects[ 4 ];
      break;
#endif
#if defined( UART5 )
    case UART5_BASE:
      return uartObjects[ 5 ];
      break;
#endif
#if defined( UART6 )
    case UART6_BASE:
      return uartObjects[ 6 ];
      break;
#endif
#if defined( UART7 )
    case UART7_BASE:
      return uartObjects[ 7 ];
      break;
#endif
#if defined( UART8 )
    case UART8_BASE:
      return uartObjects[ 8 ];
      break;
#endif

    default:
      return uartObjects[ 0 ];
      break;
  };
};

static constexpr bool isChannelSupported( const uint8_t channel )
{
  return ( ( channel == 4 ) || ( channel == 5 ) || ( channel == 7 ) || ( channel == 8 ) );
}

static void UART4ISRPostProcessor( void *argument )
{
  static constexpr uint8_t channel = 4u;

  Chimera::Threading::signalSetupComplete();

  while ( 1 )
  {
    if ( xSemaphoreTake( isrPPWakeup[ channel ], portMAX_DELAY ) == pdPASS )
    {
      if ( auto uart = uartObjects[ channel ]; uart )
      {
        uart->postISRProcessing();
      }
    }
  }
}

static void UART5ISRPostProcessor( void *argument )
{
  static constexpr uint8_t channel = 5u;

  Chimera::Threading::signalSetupComplete();

  while ( 1 )
  {
    if ( xSemaphoreTake( isrPPWakeup[ channel ], portMAX_DELAY ) == pdPASS )
    {
      if ( auto uart = uartObjects[ channel ]; uart )
      {
        uart->postISRProcessing();
      }
    }
  }
}

static void UART7ISRPostProcessor( void *argument )
{
  static constexpr uint8_t channel = 7u;

  Chimera::Threading::signalSetupComplete();

  while ( 1 )
  {
    if ( xSemaphoreTake( isrPPWakeup[ channel ], portMAX_DELAY ) == pdPASS )
    {
      if ( auto uart = uartObjects[ channel ]; uart )
      {
        uart->postISRProcessing();
      }
    }
  }
}

static void UART8ISRPostProcessor( void *argument )
{
  static constexpr uint8_t channel = 8u;

  Chimera::Threading::signalSetupComplete();

  while ( 1 )
  {
    if ( xSemaphoreTake( isrPPWakeup[ channel ], portMAX_DELAY ) == pdPASS )
    {
      if ( auto uart = uartObjects[ channel ]; uart )
      {
        uart->postISRProcessing();
      }
    }
  }
}

#endif /* THOR_STM32HAL_DRIVERS && THOR_DRIVER_UART */
